#include "../../../../include/realization/user_interaction/msg_storage/CmdRequestsStorage.hpp"
#include <sstream>

std::string CmdRequestsStorage::getRequest(unsigned int id) {
	std::ostringstream oss;
	switch (id) {
	case 1:
		oss << "Предпочитаемый стиль боя:\n"
			<< "1) ближний бой;\n"
			<< "2) дальний бой.";
		break;
	case 2:
		oss << "Предпочитаемая магия:\n"
			<< "1) стихийная;\n"
			<< "2) призыв слуг, сражающихся за тебя;\n"
			<< "3) что такое магия?.";
		break;
	case 3:
		oss << "Ради чего ты сражаешься?\n"
			<< "1) ради мира и справедливости;\n"
			<< "2) не имеет значения;\n"
			<< "3) только ради себя.";
		break;
	case 4:
		oss << "Мировоззрение:\n"
			<< "1) доброе;\n"
			<< "2) хаотичное;\n"
			<< "3) злое;\n"
			<< "4) любое.";
		break;
	case 5:
		oss << "На сколько персонаж социален?\n"
			<< "1) крайне социален;\n"
			<< "2) умеренно;\n"
			<< "4) асоциален.\n";
		break;
	case 6:
		oss << "Чему доверяешь больше магии или оружию:\n"
			<< "1) магии;\n"
			<< "2) оружию;\n"
			<< "3) и тому и тому.";
		break;
	case 7:
		oss << "Тип персонажа:\n"
			<< "1) маг;\n"
			<< "2) боец;\n"
			<< "3) смешанный.";
		break;
	case 8:
		oss << "Класс:\n"
			<< "1) воин;\n"
			<< "2) варвар;\n"
			<< "3) паладин;\n"
			<< "4) рейнджер;\n"
			<< "5) разбойник;\n"
			<< "6) волшебник;\n"
			<< "7) чернокнижник;\n"
			<< "8) бард.";
		break;
	case 9:
		oss << "Тип характера персонажа:\n"
			<< "1) эгоистичный;\n"
			<< "2) не определён;\n"
			<< "3) альтруистичный;\n"
			<< "4) хаотичный.";
		break;
	default:
		oss << "Error in CmdInteractorFactory->getRequestInteractor(" << id << ")";
	}
	return oss.str();
}
